Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/НастройкаЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастройкаЗначенийПоказателей</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>InformationRegister.ШаблоныЗначенийПоказателей</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляПоказателейВТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТУ</name>
    <type>
      <types>CatalogRef.ТУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>наАнглийскомЯзыке</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/НастройкаЗначенийПоказателей/ManagerModule.bsl
Процедура ЗаполнитьНоменклатуру(Объект) Экспорт
	
	Объект.Номенклатуры.Очистить();	
	//заполняем все ном
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	|	И НоменклатураДополнительныеРеквизиты.Значение = &ГруппаДляПоказателейВТУ";
	
	Запрос.УстановитьПараметр("ГруппаДляПоказателейВТУ", Объект.ГруппаДляПоказателейВТУ);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ГруппаДляПоказателейВТУ"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Номенклатуры.Добавить().Номенклатура = Выборка.Ссылка;
	КонецЦикла;
	
	//УправлениеСвойствами.ЗначениеСвойства(Объект.Номенклатура, "ВидПродукции(ВЕТИС)_5ee632ef8afb4eabac5c5c3b4babd429");
	
КонецПроцедуры
